package Home_Work_1;

public class ExercizeOneTwo {
    public static void main(String[] args) {

        int a = -42 ;       // в двоичной системе -42=1010101
        int b = -15;        // в двоичной системе -15=10000
        System.out.println("побитовые операции для чисел a-42, b-15:");

        int as = ~a;
        int ab = ~b;
        System.out.println("оператор ~ для a : " + as + "; оператор ~ для b : " + ab + ";");
                 // в двоичной системе 41=101001;14=1110;

        int rs = a & b;
        int ss= a | b;
        int gs = a ^ b;
        System.out.println("оператор & : " + rs + "; оператор | : " + ss + "; оператор ^ : " + gs + ";");
                 // в двоичной системе  -48=1001111;-9=10110;39=100111

        int vs = a << 2;
        int ds = a >>> 2;
        int ts = a >> 2;
        System.out.println("оператор << на 2 : " + vs + "; оператор >>> на 2 : " + ds + "; оператор >> на 2 : " + ts + " для \"a\";");
                // в двоичной системе -168=101010111; 1073741813=111111111111111111111111110101;-1=10100

        int ns = b << 2;
        int ms = b >>> 2;
        int zs = b >> 2;
        System.out.println("оператор << на 2 : " +  ns + "; оператор >>> на 2 : " + ms + "; оператор >> на 2 : " + zs + " для \"b\";");
                 // в двоичной системе -60=1000011;1073741820=111111111111111111111111111100;-4=1001

        int x = -42;
        System.out.println(Integer.toBinaryString(x));  //почему положительные числа в двоичной отображаеться кратко, а отрицателньые в 32бита
        System.out.println(Integer.toString(x));

        int ddd = a &= b;
        a = -42;
        int sss = a |= b;
        a = -42;
        int aaa = a ^= b;
        a = -42;
        System.out.println("переменная 'a' примит значение после операций присвоения:&=" + ddd +";|=" + sss + ";^=" + aaa);
        System.out.println("так же если поменять переменные места такие же значения примет переменная'b', так как эти операторы сравнивнивают два этих чиса вне зависимости от их местоположения в уравнение");

        int fff = a >>=2;
        a=-42;
        int ggg = a >>>=2;
        a=-42;
        int hhh = a <<=2;
        a=-42;
        System.out.println("переменная 'a' примит значение после операций присвоения:>>=" + fff +";>>>=" + ggg + ";<<=" + hhh);

        int qqq = b >>=2;
        b = -15;
        int www = b >>>=2;
        b = -15;
        int eee = b <<=2;
        b = -15;
        System.out.println("переменная 'b' примит значение после операций присвоения:>>=" + qqq +";>>>=" + www + ";<<=" + eee);
    }

}
